{"id":"bh-pg-1","blueprint":"brandonhall","page":"1","title":"Storyboard Revision History","content":"Page 1: Storyboard Revision History\nInstructions: Create a table with columns: Date, Task, By, Version. Populate it with 4 plausible entries showing the storyboard's development lifecycle (e.g., Initial Draft, Internal Review, Subject Matter Expert (SME) Review, Final Version). Use placeholder initials for the 'By' column.","created_at":"2025-09-21T12:53:43.822Z"}
{"id":"bh-pg-2","blueprint":"brandonhall","page":"2","title":"Pronunciation Guide","content":"Page 2: Pronunciation Guide\nInstructions: Create a table with columns: Word or Phrase and Pronunciation. Identify 5-7 key acronyms or technical jargon from the topic of '{{TOPIC}}' and provide simple, phonetic pronunciations. Include a 'Note to SME/Stakeholder' at the top asking them to validate the pronunciations.","created_at":"2025-09-21T12:53:44.090Z"}
{"id":"bh-pg-3-4","blueprint":"brandonhall","page":"3-4","title":"Table of Contents","content":"Page 3-4: Table of Contents\nInstructions: Generate a detailed Table of Contents for the course, listing approximately 15-17 sections with corresponding page numbers. The structure should include sections for Introduction, Core Content (e.g., Key Principles), Interactive sections (e.g., Scenarios), Assessments, and a Summary.","created_at":"2025-09-21T12:53:43.830Z"}
{"id":"bh-pg-5","blueprint":"brandonhall","page":"5","title":"Introduction","content":"Page 5: Introduction\nInstructions: Design a standard launch screen with the course title '{{TOPIC}}', a 'Get Started' button, and an Internal Development Note to show a relevant, high-quality background image.","created_at":"2025-09-21T12:53:43.813Z"}
{"id":"bh-pg-6","blueprint":"brandonhall","page":"6","title":"Overview","content":"Page 6: Overview\nInstructions: Create three sequential Event rows. 1. Introduce the purpose of the course. 2. State the organization's commitment to the principles of '{{TOPIC}}'. 3. Define the target audience for the module, listing 2-3 specific roles from '{{AUDIENCE}}'. Include Internal Development Notes to show an image, then an icon, then clear the screen for the target audience list.","created_at":"2025-09-21T12:53:43.804Z"}
{"id":"bh-pg-7","blueprint":"brandonhall","page":"7","title":"Learning Objectives","content":"Page 7: Learning Objectives\nInstructions: State 'At the end of this module, you will be able to:'. List 3-4 specific, action-oriented learning objectives relevant to '{{TOPIC}}'. Use verbs like 'Explain,' 'Identify,' 'Apply,' 'Differentiate.' Include Internal Development Notes to show a relevant 'goals' icon.","created_at":"2025-09-21T12:53:43.813Z"}
{"id":"bh-pg-8-9","blueprint":"brandonhall","page":"8-9","title":"Background/History","content":"Page 8-9: Background/History\nInstructions: Create an introductory text explaining the importance of the history or evolution of '{{TOPIC}}'. Design a 3-point interactive timeline. For each clickable point, provide the pop-up text that will be displayed, representing a key milestone. Internal Development Notes must specify this is a clickable timeline and how the pop-ups should function.","created_at":"2025-09-21T12:53:43.807Z"}
{"id":"bh-pg-10-11","blueprint":"brandonhall","page":"10-11","title":"Key Focus Areas","content":"Page 10-11: Key Focus Areas\nInstructions: Introduce the key functional areas of '{{TOPIC}}'. Design a list-based graphic organiser with 6 items. For each item, provide a title and an Internal Development Note specifying a relevant icon and a placeholder stock photo ID.","created_at":"2025-09-21T12:53:43.879Z"}
{"id":"bh-pg-12-14","blueprint":"brandonhall","page":"12-14","title":"Core Principles/Concepts","content":"Page 12-14: Core Principles/Concepts\nInstructions: Design an interactive graphic that visually represents 4-6 core principles of '{{TOPIC}}'. The main page should have an intro script and OST. For each principle, create a separate pop-up layer containing its title and a short explanation. Internal Development Notes must specify clickable icons for each principle. Include a placeholder SME comment: 'Commented [A1]: We've drafted the core principles for {{TOPIC}}. Could you please validate these?'","created_at":"2025-09-21T12:53:43.802Z"}
{"id":"bh-pg-15-18","blueprint":"brandonhall","page":"15-18","title":"Key Processes and Procedures","content":"Page 15-18: Key Processes and Procedures\nInstructions: Design a 3-tab interactive element to explain key processes. Label tabs appropriately for '{{TOPIC}}' (e.g., 'Initial Assessment,' 'Ongoing Management'). For each tab, create a workflow or list of steps, detailing actions and timeframes (e.g., 'Acknowledge request - within 5 business days'). Internal Development Notes must include a detailed note to the SME asking them to validate the process segregation and sequence.","created_at":"2025-09-21T12:53:43.812Z"}
{"id":"bh-pg-19-20","blueprint":"brandonhall","page":"19-20","title":"Applying a Key Process","content":"Page 19-20: Applying a Key Process\nInstructions: Recap a critical process from the previous section. State minimum standards/timeframes. Create a second section titled 'Best practices' and list 2-3 key best practices. Internal Development Notes should instruct the developer to use specific icons to visually separate the minimum standards from the best practices.","created_at":"2025-09-21T12:53:43.920Z"}
{"id":"bh-pg-21-22","blueprint":"brandonhall","page":"21-22","title":"Knowledge Check 1","content":"Page 21-22: Knowledge Check 1\nInstructions: Write one clear multiple-choice question that tests a foundational concept, but frame it with a mini-scenario or a practical context. Provide one correct answer and two plausible but incorrect distractors. Write detailed feedback for both Correct and Incorrect answers, explaining the reasoning by referencing a course concept.","created_at":"2025-09-21T12:53:43.830Z"}
{"id":"bh-pg-23","blueprint":"brandonhall","page":"23","title":"Knowledge Check 2","content":"Page 23: Knowledge Check 2\nInstructions: Write one multiple-response question asking learners to identify several correct items from a list (e.g., 'Which of the following are core principles of {{TOPIC}}?'). Provide 4-5 options, of which 2-3 are correct. Provide generic feedback for correct and incorrect responses that restates the correct answers.","created_at":"2025-09-21T12:53:43.862Z"}
{"id":"bh-pg-24","blueprint":"brandonhall","page":"24","title":"Choose Your Path","content":"Page 24: Choose Your Path\nInstructions: Design a menu screen that allows learners to choose a role-based or situation-based path for the upcoming scenarios. Include a title 'Choose your pathway.' Provide 3 distinct pathway options relevant to '{{AUDIENCE}}'. Include a 'Note to SME' box: 'This screen will be designed as per the content provided for the next scenario-based page.'","created_at":"2025-09-21T12:53:43.816Z"}
{"id":"bh-pg-25","blueprint":"brandonhall","page":"25","title":"Scenario Pathways","content":"Page 25: Scenario Pathways\nInstructions: Create a placeholder page. The Internal Development Notes section must contain a large red box with the text: 'Note to SME: This page will be developed as per the content provided by you for the scenarios.' The rest of the page (Audio, OST) should be filled with dashes or 'TBD'.","created_at":"2025-09-21T12:53:43.848Z"}
{"id":"bh-pg-26","blueprint":"brandonhall","page":"26","title":"Handling Special Cases / Advanced Topics","content":"Page 26: Handling Special Cases / Advanced Topics\nInstructions: Create another placeholder page for a specialized topic. The Internal Development Notes section must contain a large red box with the text: 'Note to SME: This page will be developed as per the content provided by you for this topic.'","created_at":"2025-09-21T12:53:43.812Z"}
{"id":"bh-pg-27-29","blueprint":"brandonhall","page":"27-29","title":"Managing Non-Compliance / Critical Incidents","content":"Page 27-29: Managing Non-Compliance / Critical Incidents\nInstructions: Introduce and define a 'critical incident' or 'breach' as it relates to '{{TOPIC}}'. Create two clickable tabs labeled 'Incident Tracking' and 'Incidents and Breaches'. For 'Incident Tracking,' provide bullet points on how incidents are recorded. For 'Incidents and Breaches,' detail the process of reviewing incidents. Internal Development Notes should specify using clickable tabs and a placeholder SME comment to provide a link to a relevant handbook.","created_at":"2025-09-21T12:53:43.865Z"}
{"id":"bh-pg-30","blueprint":"brandonhall","page":"30","title":"Escalation Pathway","content":"Page 30: Escalation Pathway\nInstructions: Design a simple, vertical, hierarchical graphic showing an escalation path. Create 4-5 levels, from 'Staff member' up to an 'External evaluation team'. The Audio script should walk the learner through this process.","created_at":"2025-09-21T12:53:43.989Z"}
{"id":"bh-pg-31-32","blueprint":"brandonhall","page":"31-32","title":"Knowledge Check 3","content":"Page 31-32: Knowledge Check 3\nInstructions: Write a short, scenario-based question that requires the learner to apply their knowledge to a situation. For example, 'A client reports X. Based on the escalation pathway, what is your immediate next step?'. Provide three options. Provide detailed feedback that references a specific rule from the course to justify the correct answer.","created_at":"2025-09-21T12:53:43.917Z"}
{"id":"bh-pg-33-34","blueprint":"brandonhall","page":"33-34","title":"Knowledge Check 4","content":"Page 33-34: Knowledge Check 4\nInstructions: Write a question asking, 'What are some of the actions you could take after an incident has been identified?'. Provide a list of 4-5 potential actions, of which 2 are correct. In the Internal Development Notes, state 'Correct answers are marked in bold.' Provide detailed feedback for the correct answer and generic 'Try again' feedback for incorrect answers.","created_at":"2025-09-21T12:53:44.007Z"}
{"id":"bh-pg-35","blueprint":"brandonhall","page":"35","title":"Summary","content":"Page 35: Summary\nInstructions: Create a final summary page titled 'Key messages.' The Audio script should be a brief recap. The OST should list 3-4 bullet points summarizing the most critical takeaways from the entire module. Internal Development Notes should instruct the developer to show an icon and add a scrollbar if needed.","created_at":"2025-09-21T12:53:43.886Z"}
{"id":"bh-pg-36","blueprint":"brandonhall","page":"36","title":"Final Page","content":"Page 36: Final Page\nInstructions: Create a blank final page of the storyboard, containing only the header '{{TOPIC}}' and the page number 'Page 36 of 36'.","created_at":"2025-09-21T12:53:43.837Z"}